{"class_name": "Model", "keras_version": "2.1.2", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "lipreader_middle", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1024], "name": "lipreader_middle", "dtype": "float32", "sparse": false}}, {"class_name": "InputLayer", "name": "lipreader_softmax", "inbound_nodes": [], "config": {"batch_input_shape": [null, 500], "name": "lipreader_softmax", "dtype": "float32", "sparse": false}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["lipreader_middle", 0, 0, {}]]], "config": {"use_bias": true, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "dense_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "trainable": true}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["lipreader_softmax", 0, 0, {}]]], "config": {"use_bias": true, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "dense_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "trainable": true}}, {"class_name": "InputLayer", "name": "syncnet_preds", "inbound_nodes": [], "config": {"batch_input_shape": [null, 21, 128], "name": "syncnet_preds", "dtype": "float32", "sparse": false}}, {"class_name": "Activation", "name": "relu_lr_dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"activation": "relu", "name": "relu_lr_dense", "trainable": true}}, {"class_name": "Activation", "name": "relu_lr_softmax", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"activation": "relu", "name": "relu_lr_softmax", "trainable": true}}, {"class_name": "LSTM", "name": "lstm_1", "inbound_nodes": [[["syncnet_preds", 0, 0, {}]]], "config": {"stateful": false, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "unit_forget_bias": true, "recurrent_constraint": null, "bias_regularizer": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "activation": "tanh", "units": 64, "dropout": 0.0, "implementation": 1, "go_backwards": false, "unroll": false, "name": "lstm_1", "return_state": false, "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "return_sequences": false, "trainable": true}}, {"class_name": "InputLayer", "name": "n_of_frames", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1], "name": "n_of_frames", "dtype": "float32", "sparse": false}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["relu_lr_dense", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["relu_lr_softmax", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "InputLayer", "name": "lipreader_softmax_ratios", "inbound_nodes": [], "config": {"batch_input_shape": [null, 2], "name": "lipreader_softmax_ratios", "dtype": "float32", "sparse": false}}, {"class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["n_of_frames", 0, 0, {}], ["batch_normalization_1", 0, 0, {}], ["batch_normalization_2", 0, 0, {}], ["lipreader_softmax_ratios", 0, 0, {}]]], "config": {"name": "concatenate_1", "trainable": true, "axis": -1}}, {"class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"use_bias": true, "units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "dense_3", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "trainable": true}}, {"class_name": "Activation", "name": "relu_fc1", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"activation": "relu", "name": "relu_fc1", "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["relu_fc1", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "name": "dropout1_p0.2", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"seed": null, "name": "dropout1_p0.2", "rate": 0.2, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["dropout1_p0.2", 0, 0, {}]]], "config": {"use_bias": true, "units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "dense_4", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "trainable": true}}, {"class_name": "Activation", "name": "relu_fc2", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "config": {"activation": "relu", "name": "relu_fc2", "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["relu_fc2", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Dropout", "name": "dropout2_p0.2", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"seed": null, "name": "dropout2_p0.2", "rate": 0.2, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "name": "sigmoid", "inbound_nodes": [[["dropout2_p0.2", 0, 0, {}]]], "config": {"use_bias": true, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "sigmoid", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "trainable": true}}], "input_layers": [["syncnet_preds", 0, 0], ["n_of_frames", 0, 0], ["lipreader_middle", 0, 0], ["lipreader_softmax", 0, 0], ["lipreader_softmax_ratios", 0, 0]], "output_layers": [["sigmoid", 0, 0]], "name": "model_1"}}