{"config": {"output_layers": [["sigmoid", 0, 0]], "name": "model_1", "input_layers": [["syncnet_preds", 0, 0], ["n_of_frames", 0, 0], ["lipreader_middle", 0, 0], ["lipreader_softmax", 0, 0], ["lipreader_softmax_ratios", 0, 0]], "layers": [{"name": "lipreader_middle", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "lipreader_middle", "sparse": false, "batch_input_shape": [null, 1024], "dtype": "float32"}}, {"name": "lipreader_softmax", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "lipreader_softmax", "sparse": false, "batch_input_shape": [null, 500], "dtype": "float32"}}, {"name": "dense_1", "inbound_nodes": [[["lipreader_middle", 0, 0, {}]]], "class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "units": 128, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}}, {"name": "dense_2", "inbound_nodes": [[["lipreader_softmax", 0, 0, {}]]], "class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "units": 64, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}}, {"name": "syncnet_preds", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "syncnet_preds", "sparse": false, "batch_input_shape": [null, 21, 128], "dtype": "float32"}}, {"name": "relu_lr_dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu_lr_dense", "activation": "relu", "trainable": true}}, {"name": "relu_lr_softmax", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu_lr_softmax", "activation": "relu", "trainable": true}}, {"name": "lstm_1", "inbound_nodes": [[["syncnet_preds", 0, 0, {}]]], "class_name": "LSTM", "config": {"bias_regularizer": null, "recurrent_dropout": 0.0, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "units": 64, "return_state": false, "unroll": false, "go_backwards": false, "implementation": 1, "recurrent_regularizer": null, "activation": "tanh", "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "use_bias": true, "activity_regularizer": null, "name": "lstm_1", "dropout": 0.0, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}}, {"name": "n_of_frames", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "n_of_frames", "sparse": false, "batch_input_shape": [null, 1], "dtype": "float32"}}, {"name": "batch_normalization_1", "inbound_nodes": [[["relu_lr_dense", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "scale": true}}, {"name": "batch_normalization_2", "inbound_nodes": [[["relu_lr_softmax", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_2", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "scale": true}}, {"name": "lipreader_softmax_ratios", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "lipreader_softmax_ratios", "sparse": false, "batch_input_shape": [null, 2], "dtype": "float32"}}, {"name": "concatenate_1", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["n_of_frames", 0, 0, {}], ["batch_normalization_1", 0, 0, {}], ["batch_normalization_2", 0, 0, {}], ["lipreader_softmax_ratios", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}}, {"name": "dense_3", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "units": 16, "use_bias": true, "activity_regularizer": null, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}}, {"name": "relu_fc1", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu_fc1", "activation": "relu", "trainable": true}}, {"name": "batch_normalization_3", "inbound_nodes": [[["relu_fc1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_3", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "scale": true}}, {"name": "dropout1_p0.2", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout1_p0.2", "seed": null, "rate": 0.2, "noise_shape": null, "trainable": true}}, {"name": "dense_4", "inbound_nodes": [[["dropout1_p0.2", 0, 0, {}]]], "class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "units": 8, "use_bias": true, "activity_regularizer": null, "name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}}, {"name": "relu_fc2", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu_fc2", "activation": "relu", "trainable": true}}, {"name": "batch_normalization_4", "inbound_nodes": [[["relu_fc2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_4", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "scale": true}}, {"name": "dropout2_p0.2", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout2_p0.2", "seed": null, "rate": 0.2, "noise_shape": null, "trainable": true}}, {"name": "sigmoid", "inbound_nodes": [[["dropout2_p0.2", 0, 0, {}]]], "class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "units": 1, "use_bias": true, "activity_regularizer": null, "name": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.2"}