backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  - [input_2, 0, 0]
  - [input_3, 0, 0]
  - [input_4, 0, 0]
  - [input_5, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 21, 112, 112, 1]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Reshape
    config:
      batch_input_shape: !!python/tuple [null, 21, 112, 112, 1]
      dtype: float32
      name: reshape_1
      target_shape: !!python/tuple [21, -1]
      trainable: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: reshape_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 21, 3]
      dtype: float32
      name: input_2
      sparse: false
    inbound_nodes: []
    name: input_2
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_1, trainable: true}
    inbound_nodes:
    - - - reshape_1
        - 0
        - 0
        - &id001 {}
      - - input_2
        - 0
        - 0
        - *id001
    name: concatenate_1
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 9.999999747378752e-05}
      name: lstm_1
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 4
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: lstm_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 1]
      dtype: float32
      name: input_3
      sparse: false
    inbound_nodes: []
    name: input_3
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 1024]
      dtype: float32
      name: input_4
      sparse: false
    inbound_nodes: []
    name: input_4
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 500]
      dtype: float32
      name: input_5
      sparse: false
    inbound_nodes: []
    name: input_5
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_2, trainable: true}
    inbound_nodes:
    - - - lstm_1
        - 0
        - 0
        - &id002 {}
      - - input_3
        - 0
        - 0
        - *id002
      - - input_4
        - 0
        - 0
        - *id002
      - - input_5
        - 0
        - 0
        - *id002
    name: concatenate_2
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 9.999999747378752e-05}
      name: dense_1
      trainable: true
      units: 64
      use_bias: true
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: batch_normalization_1
  - class_name: Dropout
    config: {name: dropout_1, noise_shape: null, rate: 0.2, seed: null, trainable: true}
    inbound_nodes:
    - - - batch_normalization_1
        - 0
        - 0
        - {}
    name: dropout_1
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 9.999999747378752e-05}
      name: dense_2
      trainable: true
      units: 32
      use_bias: true
    inbound_nodes:
    - - - dropout_1
        - 0
        - 0
        - {}
    name: dense_2
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - dense_2
        - 0
        - 0
        - {}
    name: batch_normalization_2
  - class_name: Dropout
    config: {name: dropout_2, noise_shape: null, rate: 0.2, seed: null, trainable: true}
    inbound_nodes:
    - - - batch_normalization_2
        - 0
        - 0
        - {}
    name: dropout_2
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_3
      trainable: true
      units: 1
      use_bias: true
    inbound_nodes:
    - - - dropout_2
        - 0
        - 0
        - {}
    name: dense_3
  name: model_1
  output_layers:
  - [dense_3, 0, 0]
keras_version: 2.0.9
