backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  - [input_2, 0, 0]
  - [input_3, 0, 0]
  - [input_4, 0, 0]
  - [input_5, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 21, 112, 112, 5]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Sequential
    config:
    - class_name: TimeDistributed
      config:
        batch_input_shape: !!python/tuple [null, 21, 112, 112, 5]
        dtype: float32
        layer:
          class_name: Conv2D
          config:
            activation: linear
            activity_regularizer: null
            batch_input_shape: !!python/tuple [null, 112, 112, 5]
            bias_constraint: null
            bias_initializer:
              class_name: Zeros
              config: {}
            bias_regularizer: null
            data_format: channels_last
            dilation_rate: &id001 !!python/tuple [1, 1]
            dtype: float32
            filters: 96
            kernel_constraint: null
            kernel_initializer:
              class_name: VarianceScaling
              config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
            kernel_regularizer: null
            kernel_size: !!python/tuple [3, 3]
            name: conv1_lip
            padding: valid
            strides: &id002 !!python/tuple [1, 1]
            trainable: true
            use_bias: true
        name: time_distributed_1
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: BatchNormalization
          config:
            axis: -1
            beta_constraint: null
            beta_initializer:
              class_name: Zeros
              config: {}
            beta_regularizer: null
            center: true
            epsilon: 0.001
            gamma_constraint: null
            gamma_initializer:
              class_name: Ones
              config: {}
            gamma_regularizer: null
            momentum: 0.99
            moving_mean_initializer:
              class_name: Zeros
              config: {}
            moving_variance_initializer:
              class_name: Ones
              config: {}
            name: bin1_lip
            scale: true
            trainable: true
        name: time_distributed_2
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: Activation
          config: {activation: relu, name: relu1_lip, trainable: true}
        name: time_distributed_3
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: MaxPooling2D
          config:
            data_format: channels_last
            name: pool1_lip
            padding: valid
            pool_size: !!python/tuple [3, 3]
            strides: !!python/tuple [2, 2]
            trainable: true
        name: time_distributed_4
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: Conv2D
          config:
            activation: linear
            activity_regularizer: null
            bias_constraint: null
            bias_initializer:
              class_name: Zeros
              config: {}
            bias_regularizer: null
            data_format: channels_last
            dilation_rate: *id001
            filters: 256
            kernel_constraint: null
            kernel_initializer:
              class_name: VarianceScaling
              config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
            kernel_regularizer: null
            kernel_size: !!python/tuple [5, 5]
            name: conv2_lip
            padding: valid
            strides: *id002
            trainable: true
            use_bias: true
        name: time_distributed_5
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: BatchNormalization
          config:
            axis: -1
            beta_constraint: null
            beta_initializer:
              class_name: Zeros
              config: {}
            beta_regularizer: null
            center: true
            epsilon: 0.001
            gamma_constraint: null
            gamma_initializer:
              class_name: Ones
              config: {}
            gamma_regularizer: null
            momentum: 0.99
            moving_mean_initializer:
              class_name: Zeros
              config: {}
            moving_variance_initializer:
              class_name: Ones
              config: {}
            name: bn2_lip
            scale: true
            trainable: true
        name: time_distributed_6
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: Activation
          config: {activation: relu, name: relu2_lip, trainable: true}
        name: time_distributed_7
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: MaxPooling2D
          config:
            data_format: channels_last
            name: pool2_lip
            padding: valid
            pool_size: !!python/tuple [3, 3]
            strides: !!python/tuple [2, 2]
            trainable: true
        name: time_distributed_8
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: Conv2D
          config:
            activation: linear
            activity_regularizer: null
            bias_constraint: null
            bias_initializer:
              class_name: Zeros
              config: {}
            bias_regularizer: null
            data_format: channels_last
            dilation_rate: *id001
            filters: 512
            kernel_constraint: null
            kernel_initializer:
              class_name: VarianceScaling
              config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
            kernel_regularizer: null
            kernel_size: !!python/tuple [3, 3]
            name: conv3_lip
            padding: valid
            strides: *id002
            trainable: true
            use_bias: true
        name: time_distributed_9
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: BatchNormalization
          config:
            axis: -1
            beta_constraint: null
            beta_initializer:
              class_name: Zeros
              config: {}
            beta_regularizer: null
            center: true
            epsilon: 0.001
            gamma_constraint: null
            gamma_initializer:
              class_name: Ones
              config: {}
            gamma_regularizer: null
            momentum: 0.99
            moving_mean_initializer:
              class_name: Zeros
              config: {}
            moving_variance_initializer:
              class_name: Ones
              config: {}
            name: bn3_lip
            scale: true
            trainable: true
        name: time_distributed_10
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: Activation
          config: {activation: relu, name: relu3_lip, trainable: true}
        name: time_distributed_11
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: Conv2D
          config:
            activation: linear
            activity_regularizer: null
            bias_constraint: null
            bias_initializer:
              class_name: Zeros
              config: {}
            bias_regularizer: null
            data_format: channels_last
            dilation_rate: *id001
            filters: 512
            kernel_constraint: null
            kernel_initializer:
              class_name: VarianceScaling
              config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
            kernel_regularizer: null
            kernel_size: !!python/tuple [3, 3]
            name: conv4_lip
            padding: valid
            strides: *id002
            trainable: true
            use_bias: true
        name: time_distributed_12
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: BatchNormalization
          config:
            axis: -1
            beta_constraint: null
            beta_initializer:
              class_name: Zeros
              config: {}
            beta_regularizer: null
            center: true
            epsilon: 0.001
            gamma_constraint: null
            gamma_initializer:
              class_name: Ones
              config: {}
            gamma_regularizer: null
            momentum: 0.99
            moving_mean_initializer:
              class_name: Zeros
              config: {}
            moving_variance_initializer:
              class_name: Ones
              config: {}
            name: bn4_lip
            scale: true
            trainable: true
        name: time_distributed_13
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: Activation
          config: {activation: relu, name: relu4_lip, trainable: true}
        name: time_distributed_14
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: Conv2D
          config:
            activation: linear
            activity_regularizer: null
            bias_constraint: null
            bias_initializer:
              class_name: Zeros
              config: {}
            bias_regularizer: null
            data_format: channels_last
            dilation_rate: *id001
            filters: 512
            kernel_constraint: null
            kernel_initializer:
              class_name: VarianceScaling
              config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
            kernel_regularizer: null
            kernel_size: !!python/tuple [3, 3]
            name: conv5_lip
            padding: valid
            strides: *id002
            trainable: true
            use_bias: true
        name: time_distributed_15
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: BatchNormalization
          config:
            axis: -1
            beta_constraint: null
            beta_initializer:
              class_name: Zeros
              config: {}
            beta_regularizer: null
            center: true
            epsilon: 0.001
            gamma_constraint: null
            gamma_initializer:
              class_name: Ones
              config: {}
            gamma_regularizer: null
            momentum: 0.99
            moving_mean_initializer:
              class_name: Zeros
              config: {}
            moving_variance_initializer:
              class_name: Ones
              config: {}
            name: bn5_lip
            scale: true
            trainable: true
        name: time_distributed_16
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: Activation
          config: {activation: relu, name: relu5_lip, trainable: true}
        name: time_distributed_17
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: MaxPooling2D
          config:
            data_format: channels_last
            name: pool5_lip
            padding: valid
            pool_size: !!python/tuple [3, 3]
            strides: !!python/tuple [3, 3]
            trainable: true
        name: time_distributed_18
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: Flatten
          config: {name: flatten, trainable: true}
        name: time_distributed_19
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: Dense
          config:
            activation: linear
            activity_regularizer: null
            bias_constraint: null
            bias_initializer:
              class_name: Zeros
              config: {}
            bias_regularizer: null
            kernel_constraint: null
            kernel_initializer:
              class_name: VarianceScaling
              config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
            kernel_regularizer: null
            name: fc6_lip
            trainable: true
            units: 256
            use_bias: true
        name: time_distributed_20
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: BatchNormalization
          config:
            axis: -1
            beta_constraint: null
            beta_initializer:
              class_name: Zeros
              config: {}
            beta_regularizer: null
            center: true
            epsilon: 0.001
            gamma_constraint: null
            gamma_initializer:
              class_name: Ones
              config: {}
            gamma_regularizer: null
            momentum: 0.99
            moving_mean_initializer:
              class_name: Zeros
              config: {}
            moving_variance_initializer:
              class_name: Ones
              config: {}
            name: bn6_lip
            scale: true
            trainable: true
        name: time_distributed_21
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: Activation
          config: {activation: relu, name: relu6_lip, trainable: true}
        name: time_distributed_22
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: Dense
          config:
            activation: linear
            activity_regularizer: null
            bias_constraint: null
            bias_initializer:
              class_name: Zeros
              config: {}
            bias_regularizer: null
            kernel_constraint: null
            kernel_initializer:
              class_name: VarianceScaling
              config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
            kernel_regularizer: null
            name: fc7_lip
            trainable: true
            units: 128
            use_bias: true
        name: time_distributed_23
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: BatchNormalization
          config:
            axis: -1
            beta_constraint: null
            beta_initializer:
              class_name: Zeros
              config: {}
            beta_regularizer: null
            center: true
            epsilon: 0.001
            gamma_constraint: null
            gamma_initializer:
              class_name: Ones
              config: {}
            gamma_regularizer: null
            momentum: 0.99
            moving_mean_initializer:
              class_name: Zeros
              config: {}
            moving_variance_initializer:
              class_name: Ones
              config: {}
            name: bn7_lip
            scale: true
            trainable: true
        name: time_distributed_24
        trainable: false
    - class_name: TimeDistributed
      config:
        layer:
          class_name: Activation
          config: {activation: relu, name: relu7_lip, trainable: true}
        name: time_distributed_25
        trainable: false
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: sequential_2
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 21, 3]
      dtype: float32
      name: input_2
      sparse: false
    inbound_nodes: []
    name: input_2
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_1, trainable: true}
    inbound_nodes:
    - - - sequential_2
        - 1
        - 0
        - &id003 {}
      - - input_2
        - 0
        - 0
        - *id003
    name: concatenate_1
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 9.999999747378752e-05}
      name: lstm_1
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 256
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: lstm_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 1]
      dtype: float32
      name: input_3
      sparse: false
    inbound_nodes: []
    name: input_3
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 1024]
      dtype: float32
      name: input_4
      sparse: false
    inbound_nodes: []
    name: input_4
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 500]
      dtype: float32
      name: input_5
      sparse: false
    inbound_nodes: []
    name: input_5
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_2, trainable: true}
    inbound_nodes:
    - - - lstm_1
        - 0
        - 0
        - &id004 {}
      - - input_3
        - 0
        - 0
        - *id004
      - - input_4
        - 0
        - 0
        - *id004
      - - input_5
        - 0
        - 0
        - *id004
    name: concatenate_2
  - class_name: Reshape
    config:
      batch_input_shape: !!python/tuple [null, 1781]
      dtype: float32
      name: reshape_1
      target_shape: !!python/tuple [1781, 1, 1]
      trainable: true
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - {}
    name: reshape_1
  - class_name: Model
    config:
      input_layers:
      - [input_6, 0, 0]
      layers:
      - class_name: InputLayer
        config:
          batch_input_shape: !!python/tuple [null, 1781, 1, 1]
          dtype: float32
          name: input_6
          sparse: false
        inbound_nodes: []
        name: input_6
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 64
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: !!python/tuple [7, 7]
          name: conv2d_1
          padding: same
          strides: !!python/tuple [2, 2]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - input_6
            - 0
            - 0
            - {}
        name: conv2d_1
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: batch_normalization_1
          scale: true
          trainable: true
        inbound_nodes:
        - - - conv2d_1
            - 0
            - 0
            - {}
        name: batch_normalization_1
      - class_name: Activation
        config: {activation: relu, name: activation_1, trainable: true}
        inbound_nodes:
        - - - batch_normalization_1
            - 0
            - 0
            - {}
        name: activation_1
      - class_name: MaxPooling2D
        config:
          data_format: channels_last
          name: max_pooling2d_1
          padding: same
          pool_size: !!python/tuple [3, 3]
          strides: !!python/tuple [2, 2]
          trainable: true
        inbound_nodes:
        - - - activation_1
            - 0
            - 0
            - {}
        name: max_pooling2d_1
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 64
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: !!python/tuple [1, 1]
          name: conv2d_2
          padding: same
          strides: &id007 !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - max_pooling2d_1
            - 0
            - 0
            - {}
        name: conv2d_2
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: batch_normalization_2
          scale: true
          trainable: true
        inbound_nodes:
        - - - conv2d_2
            - 0
            - 0
            - {}
        name: batch_normalization_2
      - class_name: Activation
        config: {activation: relu, name: activation_2, trainable: true}
        inbound_nodes:
        - - - batch_normalization_2
            - 0
            - 0
            - {}
        name: activation_2
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 64
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: &id008 !!python/tuple [3, 3]
          name: conv2d_3
          padding: same
          strides: &id005 !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - activation_2
            - 0
            - 0
            - {}
        name: conv2d_3
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: batch_normalization_3
          scale: true
          trainable: true
        inbound_nodes:
        - - - conv2d_3
            - 0
            - 0
            - {}
        name: batch_normalization_3
      - class_name: Activation
        config: {activation: relu, name: activation_3, trainable: true}
        inbound_nodes:
        - - - batch_normalization_3
            - 0
            - 0
            - {}
        name: activation_3
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 256
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: &id013 !!python/tuple [1, 1]
          name: conv2d_5
          padding: valid
          strides: !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - max_pooling2d_1
            - 0
            - 0
            - {}
        name: conv2d_5
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 256
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: &id009 !!python/tuple [1, 1]
          name: conv2d_4
          padding: same
          strides: *id005
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - activation_3
            - 0
            - 0
            - {}
        name: conv2d_4
      - class_name: Add
        config: {name: add_1, trainable: true}
        inbound_nodes:
        - - - conv2d_5
            - 0
            - 0
            - &id006 {}
          - - conv2d_4
            - 0
            - 0
            - *id006
        name: add_1
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: batch_normalization_4
          scale: true
          trainable: true
        inbound_nodes:
        - - - add_1
            - 0
            - 0
            - {}
        name: batch_normalization_4
      - class_name: Activation
        config: {activation: relu, name: activation_4, trainable: true}
        inbound_nodes:
        - - - batch_normalization_4
            - 0
            - 0
            - {}
        name: activation_4
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 64
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: &id011 !!python/tuple [1, 1]
          name: conv2d_6
          padding: same
          strides: *id007
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - activation_4
            - 0
            - 0
            - {}
        name: conv2d_6
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: batch_normalization_5
          scale: true
          trainable: true
        inbound_nodes:
        - - - conv2d_6
            - 0
            - 0
            - {}
        name: batch_normalization_5
      - class_name: Activation
        config: {activation: relu, name: activation_5, trainable: true}
        inbound_nodes:
        - - - batch_normalization_5
            - 0
            - 0
            - {}
        name: activation_5
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 64
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: *id008
          name: conv2d_7
          padding: same
          strides: *id005
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - activation_5
            - 0
            - 0
            - {}
        name: conv2d_7
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: batch_normalization_6
          scale: true
          trainable: true
        inbound_nodes:
        - - - conv2d_7
            - 0
            - 0
            - {}
        name: batch_normalization_6
      - class_name: Activation
        config: {activation: relu, name: activation_6, trainable: true}
        inbound_nodes:
        - - - batch_normalization_6
            - 0
            - 0
            - {}
        name: activation_6
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 256
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: *id009
          name: conv2d_8
          padding: same
          strides: *id005
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - activation_6
            - 0
            - 0
            - {}
        name: conv2d_8
      - class_name: Add
        config: {name: add_2, trainable: true}
        inbound_nodes:
        - - - add_1
            - 0
            - 0
            - &id010 {}
          - - conv2d_8
            - 0
            - 0
            - *id010
        name: add_2
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: batch_normalization_7
          scale: true
          trainable: true
        inbound_nodes:
        - - - add_2
            - 0
            - 0
            - {}
        name: batch_normalization_7
      - class_name: Activation
        config: {activation: relu, name: activation_7, trainable: true}
        inbound_nodes:
        - - - batch_normalization_7
            - 0
            - 0
            - {}
        name: activation_7
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 64
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: *id011
          name: conv2d_9
          padding: same
          strides: *id007
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - activation_7
            - 0
            - 0
            - {}
        name: conv2d_9
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: batch_normalization_8
          scale: true
          trainable: true
        inbound_nodes:
        - - - conv2d_9
            - 0
            - 0
            - {}
        name: batch_normalization_8
      - class_name: Activation
        config: {activation: relu, name: activation_8, trainable: true}
        inbound_nodes:
        - - - batch_normalization_8
            - 0
            - 0
            - {}
        name: activation_8
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 64
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: *id008
          name: conv2d_10
          padding: same
          strides: *id005
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - activation_8
            - 0
            - 0
            - {}
        name: conv2d_10
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: batch_normalization_9
          scale: true
          trainable: true
        inbound_nodes:
        - - - conv2d_10
            - 0
            - 0
            - {}
        name: batch_normalization_9
      - class_name: Activation
        config: {activation: relu, name: activation_9, trainable: true}
        inbound_nodes:
        - - - batch_normalization_9
            - 0
            - 0
            - {}
        name: activation_9
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 256
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: *id009
          name: conv2d_11
          padding: same
          strides: *id005
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - activation_9
            - 0
            - 0
            - {}
        name: conv2d_11
      - class_name: Add
        config: {name: add_3, trainable: true}
        inbound_nodes:
        - - - add_2
            - 0
            - 0
            - &id012 {}
          - - conv2d_11
            - 0
            - 0
            - *id012
        name: add_3
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: batch_normalization_10
          scale: true
          trainable: true
        inbound_nodes:
        - - - add_3
            - 0
            - 0
            - {}
        name: batch_normalization_10
      - class_name: Activation
        config: {activation: relu, name: activation_10, trainable: true}
        inbound_nodes:
        - - - batch_normalization_10
            - 0
            - 0
            - {}
        name: activation_10
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: *id011
          name: conv2d_12
          padding: same
          strides: &id022 !!python/tuple [2, 2]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - activation_10
            - 0
            - 0
            - {}
        name: conv2d_12
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: batch_normalization_11
          scale: true
          trainable: true
        inbound_nodes:
        - - - conv2d_12
            - 0
            - 0
            - {}
        name: batch_normalization_11
      - class_name: Activation
        config: {activation: relu, name: activation_11, trainable: true}
        inbound_nodes:
        - - - batch_normalization_11
            - 0
            - 0
            - {}
        name: activation_11
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: *id008
          name: conv2d_13
          padding: same
          strides: *id005
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - activation_11
            - 0
            - 0
            - {}
        name: conv2d_13
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: batch_normalization_12
          scale: true
          trainable: true
        inbound_nodes:
        - - - conv2d_13
            - 0
            - 0
            - {}
        name: batch_normalization_12
      - class_name: Activation
        config: {activation: relu, name: activation_12, trainable: true}
        inbound_nodes:
        - - - batch_normalization_12
            - 0
            - 0
            - {}
        name: activation_12
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 512
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: *id013
          name: conv2d_15
          padding: valid
          strides: !!python/tuple [2, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - add_3
            - 0
            - 0
            - {}
        name: conv2d_15
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 512
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: *id009
          name: conv2d_14
          padding: same
          strides: *id005
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - activation_12
            - 0
            - 0
            - {}
        name: conv2d_14
      - class_name: Add
        config: {name: add_4, trainable: true}
        inbound_nodes:
        - - - conv2d_15
            - 0
            - 0
            - &id014 {}
          - - conv2d_14
            - 0
            - 0
            - *id014
        name: add_4
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: batch_normalization_13
          scale: true
          trainable: true
        inbound_nodes:
        - - - add_4
            - 0
            - 0
            - {}
        name: batch_normalization_13
      - class_name: Activation
        config: {activation: relu, name: activation_13, trainable: true}
        inbound_nodes:
        - - - batch_normalization_13
            - 0
            - 0
            - {}
        name: activation_13
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
          kernel_regularizer:
            class_name: L1L2
            config: {l1: 0.0, l2: 9.999999747378752e-05}
          kernel_size: *id011
          name: conv2d_16
          padding: same
          strides: *id007
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - activation_13
            - 0
            - 0
            - {}
        name: conv2d_16
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: batch_normalization_14
